app/controllers/api/v1/registrations_controller.rb

  def create
    user = User.new user_params
    if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `authentication_token`, `first_name`, `last_name`) VALUES ('ndt01231999@gmail.com', '$2a$12$sEN7vCOFJir7XBU3miwtFexF4VBAI5INvb8Jk79UiIMNKun0HVsHW', '2021-02-09 16:50:22.718004', '2021-02-09 16:50:22.718004', 'kHyQ5sdXMycWHMS4Yptc', 'Nguyễn', 'Duy Tâm')