app/controllers/api/v1/sessions_controller.rb

  def load_user
    @user = User.find_for_database_authentication(email: sign_in_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'ndt012399@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1